rest-server/src/soap/client/CAPSoapHttp.postCAP.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns3="http://gov.fema.ipaws.services/caprequest"
    xmlns:ns4="http://gov.fema.ipaws.services/capresponse"
    xmlns:ns5="urn:oasis:names:tc:emergency:cap:1.2"
    xmlns:ns2="http://gov.fema.ipaws.services/IPAWS_CAPService/">
 <SOAP-ENV:Header>
  <ns2:CAPHeaderTypeDef SOAP-ENV:mustUnderstand="1">
   <ns2:logonUser></ns2:logonUser>
   <ns2:logonCogId>0</ns2:logonCogId>
  </ns2:CAPHeaderTypeDef>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns2:postCAPRequestTypeDef>
    <ns5:alert>
     <ns5:identifier></ns5:identifier>
     <ns5:sender></ns5:sender>
     <ns5:sent>2019-02-06T21:09:52Z</ns5:sent>
     <ns5:status>Actual</ns5:status>
     <ns5:msgType>Alert</ns5:msgType>
     <ns5:source></ns5:source>
     <ns5:scope>Public</ns5:scope>
     <ns5:restriction></ns5:restriction>
     <ns5:addresses></ns5:addresses>
     <ns5:code></ns5:code>
     <ns5:note></ns5:note>
     <ns5:references></ns5:references>
     <ns5:incidents></ns5:incidents>
     <ns5:info>
      <ns5:language></ns5:language>
      <ns5:category>Geo</ns5:category>
      <ns5:event></ns5:event>
      <ns5:responseType>Shelter</ns5:responseType>
      <ns5:urgency>Immediate</ns5:urgency>
      <ns5:severity>Extreme</ns5:severity>
      <ns5:certainty>Observed</ns5:certainty>
      <ns5:audience></ns5:audience>
      <ns5:eventCode>
       <ns5:valueName></ns5:valueName>
       <ns5:value></ns5:value>
      </ns5:eventCode>
      <ns5:effective>2019-02-06T21:09:52Z</ns5:effective>
      <ns5:onset>2019-02-06T21:09:52Z</ns5:onset>
      <ns5:expires>2019-02-06T21:09:52Z</ns5:expires>
      <ns5:senderName></ns5:senderName>
      <ns5:headline></ns5:headline>
      <ns5:description></ns5:description>
      <ns5:instruction></ns5:instruction>
      <ns5:web>http://www.example.com/schema/anyURI</ns5:web>
      <ns5:contact></ns5:contact>
      <ns5:parameter>
       <ns5:valueName></ns5:valueName>
       <ns5:value></ns5:value>
      </ns5:parameter>
      <ns5:resource>
       <ns5:resourceDesc></ns5:resourceDesc>
       <ns5:mimeType></ns5:mimeType>
       <ns5:size>0</ns5:size>
       <ns5:uri>http://www.example.com/schema/anyURI</ns5:uri>
       <ns5:derefUri></ns5:derefUri>
       <ns5:digest></ns5:digest>
      </ns5:resource>
      <ns5:area>
       <ns5:areaDesc></ns5:areaDesc>
       <ns5:polygon></ns5:polygon>
       <ns5:circle></ns5:circle>
       <ns5:geocode>
        <ns5:valueName></ns5:valueName>
        <ns5:value></ns5:value>
       </ns5:geocode>
       <ns5:altitude>0.0</ns5:altitude>
       <ns5:ceiling>0.0</ns5:ceiling>
      </ns5:area>
     </ns5:info>

    </ns5:alert>
   </ns2:postCAPRequestTypeDef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
